app/controllers/liked_posts_controller.rb

SELECT "liked_posts".* FROM "liked_posts"
---
  def index
    @liked_posts = LikedPost.all

SELECT "liked_posts".* FROM "liked_posts" WHERE "liked_posts"."user_id" = $1  [["user_id", 7]]
---
  def liked_posts
    @liked_posts = LikedPost.where(user_id: @user.id)

INSERT INTO "liked_posts" ("title", "content", "likes", "user_id", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "newuser5"], ["content", "newuser5"], ["likes", 1], ["user_id", 9], ["created_at", "2021-03-07 00:42:01.857156"], ["updated_at", "2021-03-07 00:42:01.857156"], ["username", "newuser7"]]
---
  def create
    @liked_post = LikedPost.new(liked_post_params)
    @liked_post.user_id = @user.id
    @liked_post.username = @user.username

    if @liked_post.save

UPDATE "posts" SET "likes" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes", 7], ["updated_at", "2021-03-11 02:29:46.389804"], ["id", 7]]
---
  def update
    if @liked_post.update(liked_post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "liked_posts".* FROM "liked_posts" WHERE "liked_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_liked_post
      @liked_post = LikedPost.find(params[:id])