app/controllers/posts_controller.rb

  def show
    @posts = Post.where(user_id: @user.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 6]]

  def user_posts
    @posts = Post.where(user_id: @user.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 7]]

  def create
    @post = Post.new(post_params)
    @post.user_id = @user.id
    @post.username = @user.username

    if @post.save
---
INSERT INTO "posts" ("title", "topic", "content", "likes", "created_at", "updated_at", "user_id", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "likes" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes", 5], ["updated_at", "2021-03-07 01:32:18.809033"], ["id", 5]]