app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 6]]
---
  def index
    @posts = Post.where(user_id: @user.id)