app/controllers/users_controller.rb

  def index
    # @user = User.where(id: @user.id)
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$12$PYVmCyQjRdIobFN9LVfwX.V8XsH/IRpbsfX8j/tVTU3XQJyIcsIlG"], ["created_at", "2021-03-11 00:32:11.421241"], ["updated_at", "2021-03-11 00:32:11.421241"]]